The roofs cannot be joined because the roof being joined meets the target roof tangentially.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RoofMeetsRoofTangentially { get; }
  Visual Basic
Public Shared ReadOnly Property RoofMeetsRoofTangentially As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RoofMeetsRoofTangentially {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoofFailures Class
  Autodesk.Revit.DB Namespace